       IDENTIFICATION DIVISION.
       PROGRAM-ID. inittest.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NAME  PIC X(20) VALUE "HELLO WORLD".
       01 WS-COUNT PIC 9(4) VALUE 1234.
       01 WS-TEXT  PIC X(10) VALUE "ABCDEFGHIJ".
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY WS-NAME
           DISPLAY WS-COUNT
           DISPLAY WS-TEXT
           INITIALIZE WS-NAME WS-COUNT WS-TEXT
           DISPLAY WS-NAME
           DISPLAY WS-COUNT
           DISPLAY WS-TEXT
           STOP RUN.
